{
    "ABOUT": "About",
    "EXPERIENCE": "Work experience",
    "EDUCATION": "Academic data",
    "SKILLS": "Skills",
    "LANGUAGES": "Languages",
    "OTHER": "Other data of interest",

    "email": "Email",
    "age": "Current age",
    "city": "City of residence",

    "aboutPageParagraph1": "Hi! My name is Francisco, or Fran or Vigo for friends. I am graduated in Mathematics by the University of Málaga, although as I studied it I discovered I am passionated about programming. Afther finishing it, I began working as a fullstack software engineer with Java (along with Spring) as main programming language. I have also studied a Master's degree on Data Science by the University of Granada.",
    "aboutPageParagraph2": "I have worked with HTML5 and with the framework React in several personal projects (do not hesitate to pay a visit to my GitHub). Same with Python, which I have also used as a tool for scientific calculus as well as for Data Science and Machine Learning during my Master's degree. However, the languages I feel most comfortable with are Java, my main tool in my work experience, and Scala, a language that, just like Kotlin, works on the JVM and natively integrates both functional and object oriented programming. In \"Skills\" you cand find further information about the technologies I know.",
    "aboutPageParagraph3": "As the world of technology is so big (and everyday more!), I try to remain the awaken kid who sees it all with amazement and looks forward to learning everything everyday. But that is, as I see it, neither my main virtue nor part of the ones I take pride the most. The first of them I trained it during my Bachelor's degree years, and that is my analytical approach. When facing any problem that might come up, there is nothing like hit the pause button and think it through. By dissecting it, with the help of pen and paper, allows one to understand what are its details, its challenges, the possibles solutions to implement and the value each may bring, the involved parts and, in general, any relevant aspect of it. To plan is everything. My other main virtue, equally important to me, is communication. At any situation in life, but especially in such a potentially complex context as a work environment, a good quality communcation is crucial. The fact that the message transmitted in a clear, precise and, above all, effective way, is often more challenging than could be expected, as is receiving the message and assure it is understood. For this reason, I always do my best to care beforehand about how I express myself, like a craftman, and how I pay attention when someone else is talking or writing.",
    "aboutPageParagraph4": "I welcome you to my LinkedIn profile. If you think I can help you anyhow, don to hesitate to ask!",

    "experiencePageGraduate": "<i>Graduate Engineer</i> (September 2019 - March 2020).",
    "experiencePageJunior": "<i>Junior Software Engineer</i> (Mars 2020 - September 2020).",
    "experiencePageMiddle": "<i>Software Engineer</i> (September 2020 - September 2021).",
    "experiencePageParagraph1": "As a developer in The Workshop, I worked essencially (but not exclusivelly) on backend tasks with projects written in Java (both 1.8 and 11), with Maven 3 and the framework Spring Boot. My responsibilities covered from the planning and the actual writing of the code  to the testing (including several levels) and the deployment. All the work was framed in a agile methodology following the SCRUM model.",
    "experiencePageParagraph2": "One of the first projects I worked on consisted of the development of a backend from scratch to its deployment. Other projects of interest include the participation in an ETL or the design of a mechanism of reporting by menas of the query to several databases.",

    "educationPageUniversity": "University education.",
    "educationPageNonUniversity": "Non university education.",
    "educationPageLanguages": "Languages.",
    "educationPageUniversityLi1": "Bachelor's degree on Mathematics by the University of Málaga. 2015-2019. Mean score: 8,49.",
    "educationPageUniversityLi2": "Participant in the Erasmus+ programme at la University of Helsinki, Finland, as a student of Mathematics during the school year 2017-2018.",
    "educationPageUniversityLi3": "Master's degree on Data Science and Computers Engineering by the University of Granada. 2021-2022. Mean score: 8,63.",
    "educationPageUniversityLi4": "Participant in the programme <i>Cátedra Talento y Liderazgo</i> (Talent and Leadership programme) by the University of Granda and Alight (V Edition) during the school year 2021-2022.",
    "educationPageNonUniversityLi1": "<i>Fundamentos en redes</i>, by EDteam. Certificate issued in September of 2020.",
    "educationPageNonUniversityLi2": "<i>Introducción a la Inteligencia Artificial</i>, by EDteam. Certificate issued in October of 2020.",
    "educationPageNonUniversityLi3": "<i>Máster en CSS: <i>Responsiveness</i>, SASS, Flexbox, Grid y Bootstrap</i>, by Udemy. Certificate issued in October of 2022.",
    "educationPageNonUniversityLi4": "<i>The complete Google Sheets Course: Beginner to Advanced!</i>, by Udemy. Certificate issued in November of 2022.",
    "educationPageNonUniversityLi5": "<i>The complete SQL Bootcamp 2022: Go from Zero to Hero (PostgreSQL)</i>, by Udemy. Certificate issued in November of 2022.",
    "educationPageNonUniversityLi6": "<i>Master Spring framework, Spring Boot, REST, JPA, Hibernate</i>, by Udemy. Certificate issued in November of 2022.",
    "educationPageLanguagesLi1": "<i>Cambridge English: Preliminary</i> (B1 in English) by Cambridge University Press & Assessment English. Certificate issued in January of 2014.",
    "educationPageLanguagesLi2": "<i>Cambridge English: First</i> (B2 in English) by Cambridge University Press & Assessment English. Certificate issued in July of 2014.",
    "educationPageLanguagesLi3": "<i>Cambridge English: Advanced</i> (C1 in English) by Cambridge University Press & Assessment English. Certificate issued in August of 2016.",

    "skillsPageJavaRelated": "Java related.",
    "skillsPageSpring": "Spring and Spring Boot.",
    "skillsPageJSRelated": "JavaScript related.",
    "skillsPageOtherLanguages": "Other languages.",
    "skillsPageOthers": "Others.",

    "languagesPageES": "Spanish native level",
    "languagesPageEN": "English with C1 level by Cambridge University Press & Assessment English. Put into practice during the school year 2017-2018 at the University of Helsinki, Finland, and during my work experience in an international environment.",

    "otherPageLi1": "Candidate to the VII Awards of Education “Ciudad de Málaga” 2015.",
    "otherPageLi2": "Very good communicative skills.",
    "otherPageLi3": "Publications in Amazon:"
}